backend/app/controllers/counties_controller.rb

  def index
    @counties = County.all
---
SELECT "counties".* FROM "counties"