backend/app/controllers/nationals_controller.rb

SELECT "nationals".* FROM "nationals"
---
  def index
    @nationals = National.all