backend/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "ochachamoses@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "blocked" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["blocked", 1], ["updated_at", "2023-05-25 21:37:07.959717"], ["id", 1]]
---
  def authenticate
    user = User.find_by(email: params[:email])

    if user.nil?
      user_not_found
    elsif user.authenticate(params[:password])
      reset_failed_attempts(user)
      token = encode({ user_id: user.id, email: user.email, status: user.blocked? })

      role_message = case user.role
        when "admin"
          "Welcome, Admin!"
        when "clerk"
          "Welcome, Clerk!"
        else
          "Welcome, User!"
        end

      render json: { token: token, message: role_message }, status: :ok
    else
      increment_failed_attempts(user)
      if user.failed_login_attempts >= 3
        user.update(blocked: true)

INSERT INTO "users" ("name", "email", "password_digest", "role", "blocked", "failed_login_attempts", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    begin
      user = User.new(user_params)
      user.password = params[:password]
      user.password_confirmation = params[:password_confirmation]
      user.save!

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "ocbcjsb@gmail.com"], ["LIMIT", 1]]
---
  def check_blocked_status
    user = User.find_by(email: params[:email])

UPDATE "users" SET "failed_login_attempts" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["failed_login_attempts", 1], ["updated_at", "2023-05-25 21:59:25.110416"], ["id", 1]]
---
  def increment_failed_attempts(user)
    user.update(failed_login_attempts: user.failed_login_attempts + 1)